Autodesk.Revit.DB.CurtainGridLine.AddMullions(Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.MullionType,System.Boolean)
Add mullions on the specified segments of a grid. If any segment already has a mullion, no change is made to that segment.
segment:  Curve of the segment.
mullionType:  The type of the mullion to add.
oneSegmentOnly:  If true, add one mullion to the specified segment, otherwise add mullions to all the segments of the matching grid line.
Returns: If operation succeeds, the created mullions will be returned.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Invalid curtain grid line or invalid mullion type argument.

Autodesk.Revit.DB.CurtainGridLine.AddAllSegments
All the segments on this grid line will be added.

Autodesk.Revit.DB.CurtainGridLine.AddSegment(Autodesk.Revit.DB.Curve)
Add a segment based on the specified segment curve of the gridline.
curve:  The curve used to locate the segment to be removed. This function will invoke regeneration.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Segment may not have been found in location indicated by curve.

Autodesk.Revit.DB.CurtainGridLine.RemoveSegment(Autodesk.Revit.DB.Curve)
Remove the segment specified by the input curve.
curve:  The curve used to locate the segment to be removed.
Remarks: When a segment is removed, the neighboring two panels will be merged into one panel.  This function will invoke regeneration.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Segment may not have been found in location indicated by curve.

Autodesk.Revit.DB.CurtainGridLine.ExistingSegmentCurves
Retrieve all the existing segment curves of the grid line.
Remarks: User can get these curves and call RemoveSegment() to remove the segments to the gridline or call AddMullions() to add mullions to these segments.

Autodesk.Revit.DB.CurtainGridLine.SkippedSegmentCurves
Retrieve all the removed segment curves of the grid line.
Remarks: User can get these curves and then call the method AddSegment() to add the segments to the grid line.

Autodesk.Revit.DB.CurtainGridLine.AllSegmentCurves
Retrieve the curves of all segments.
Remarks: User can get these curves and then call the method AddSegment() or RemoveSegment() to add/remove specified segments.
If the specified segment is already added/removed, nothing will happen.

Autodesk.Revit.DB.CurtainGridLine.FullCurve
Retrieve the geometry curve of the curtain grid line.

Autodesk.Revit.DB.CurtainGridLine.IsUGridLine
Retrieve the direction of a grid line.If it is true,we say it is a UGridLine,otherwise it is VGridLine

Autodesk.Revit.DB.CurtainGridLine.Lock
Retrieves or changes the lock state of the curtain grid line.

Autodesk.Revit.DB.CurtainGridLine
Represents a CurtainGridLine within Autodesk Revit.